## pandas.DataFrame.fillna()函数

### 功能
使用指定方法填充NA/NaN值

### inplace参数的取值：True、False

True：直接修改原对象

False：创建一个副本，修改副本，原对象不变（缺省默认）

### method参数的取值 ： {‘pad’, ‘ffill’,‘backfill’, ‘bfill’, None}, default None

pad/ffill：用前一个非缺失值去填充该缺失值

backfill/bfill：用下一个非缺失值填充该缺失值

None：指定一个值去替换缺失值（缺省默认这种方式）

### limit参数：限制填充个数

### axis参数：修改填充方向

In [3]:
import pandas as pd
import numpy as np
from numpy import nan as NaN

In [4]:
df1=pd.DataFrame([[1,2,3],[NaN,NaN,2],[NaN,NaN,NaN],[8,8,NaN]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

#### 一、不指定任何参数
1.  用常数填充

In [5]:
print (df1.fillna(100))
print ("-----------------------")
print (df1)

       0      1      2
0    1.0    2.0    3.0
1  100.0  100.0    2.0
2  100.0  100.0  100.0
3    8.0    8.0  100.0
-----------------------
     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  2.0
2  NaN  NaN  NaN
3  8.0  8.0  NaN

2.  用字典填充

In [6]:
df1.fillna({0:10,1:20,2:30})

      0     1     2
0   1.0   2.0   3.0
1  10.0  20.0   2.0
2  10.0  20.0  30.0
3   8.0   8.0  30.0

### 二、指定inplace参数

In [7]:
print (df1.fillna(0,inplace=True))
print ("-------------------------")
print (df1)

None
-------------------------
     0    1    2
0  1.0  2.0  3.0
1  0.0  0.0  2.0
2  0.0  0.0  0.0
3  8.0  8.0  0.0

### 三、指定method参数
1.method = 'ffill'/'pad'：用前一个非缺失值去填充该缺失值

In [8]:
df2 = pd.DataFrame(np.random.randint(0,10,(5,5)))
df2.iloc[1:4,3] = NaN
df2.iloc[2:4,4] = NaN
df2

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  NaN  3.0
2  9  6  7  NaN  NaN
3  8  6  4  NaN  NaN
4  7  5  5  2.0  2.0

In [9]:
df2.fillna(method='ffill')

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  7.0  3.0
2  9  6  7  7.0  3.0
3  8  6  4  7.0  3.0
4  7  5  5  2.0  2.0

2.method = 'bflii'/'backfill'：用下一个非缺失值填充该缺失值

In [10]:
df2.fillna(method='bfill')

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  2.0  3.0
2  9  6  7  2.0  2.0
3  8  6  4  2.0  2.0
4  7  5  5  2.0  2.0

### 四、指定limit参数

#### 用下一个非缺失值填充该缺失值,只填充2个

In [14]:
df2

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  NaN  3.0
2  9  6  7  NaN  NaN
3  8  6  4  NaN  NaN
4  7  5  5  2.0  2.0

In [11]:
df2.fillna(method='bfill', limit=2)

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  NaN  3.0
2  9  6  7  2.0  2.0
3  8  6  4  2.0  2.0
4  7  5  5  2.0  2.0

### 五、指定axis参数

In [15]:
df2

   0  1  2    3    4
0  5  4  4  7.0  9.0
1  1  0  1  NaN  3.0
2  9  6  7  NaN  NaN
3  8  6  4  NaN  NaN
4  7  5  5  2.0  2.0

In [12]:
df2.fillna(method="ffill", limit=1, axis=1)

     0    1    2    3    4
0  5.0  4.0  4.0  7.0  9.0
1  1.0  0.0  1.0  1.0  3.0
2  9.0  6.0  7.0  7.0  NaN
3  8.0  6.0  4.0  4.0  NaN
4  7.0  5.0  5.0  2.0  2.0